In [1]:
import pandas as pd

In [2]:
df_base = pd.read_csv("C:\\Users\\user-01\\Desktop\\case will bank\\Case_Bank_Customer.csv")

In [3]:
df_base.head()

,Unnamed: 0,customer_id,credit_score,tenure,products_number,credit_card,active_member,country,age,gender,balance,churn,estimated_salary
0,0,15634602,619,2,1,1,1,France,42,NaN,0.00,1,0.0
1,1,15647311,608,1,1,0,1,Spain,41,Female,83807.86,0,0.0
2,2,15619304,502,8,3,1,0,France,42,Female,159660.80,1,0.0
3,3,15701354,699,1,2,0,0,France,39,Female,0.00,0,0.0
4,4,15737888,850,2,1,1,1,Spain,43,Female,125510.82,0,0.0

In [4]:
df_base.shape

(10000, 13)

In [5]:
df_dropcolumn = df_base.drop('Unnamed: 0', axis = 1)

In [6]:
df_dropcolumn.head()

,customer_id,credit_score,tenure,products_number,credit_card,active_member,country,age,gender,balance,churn,estimated_salary
0,15634602,619,2,1,1,1,France,42,NaN,0.00,1,0.0
1,15647311,608,1,1,0,1,Spain,41,Female,83807.86,0,0.0
2,15619304,502,8,3,1,0,France,42,Female,159660.80,1,0.0
3,15701354,699,1,2,0,0,France,39,Female,0.00,0,0.0
4,15737888,850,2,1,1,1,Spain,43,Female,125510.82,0,0.0

In [7]:
df_dropcolumn.shape

(10000, 12)

In [8]:
df_dropcolumn.isna().sum()

customer_id           0
credit_score          0
tenure                0
products_number       0
credit_card           0
active_member         0
country               0
age                   0
gender              520
balance               0
churn                 0
estimated_salary      0
dtype: int64

In [9]:
df_dropna = df_dropcolumn.dropna()

In [10]:
df_dropna.head()

,customer_id,credit_score,tenure,products_number,credit_card,active_member,country,age,gender,balance,churn,estimated_salary
1,15647311,608,1,1,0,1,Spain,41,Female,83807.86,0,0.0
2,15619304,502,8,3,1,0,France,42,Female,159660.80,1,0.0
3,15701354,699,1,2,0,0,France,39,Female,0.00,0,0.0
4,15737888,850,2,1,1,1,Spain,43,Female,125510.82,0,0.0
5,15574012,645,8,2,1,0,Spain,44,Male,113755.78,1,0.0

In [11]:
df_dropna.shape

(9480, 12)

In [12]:
df_dropcolumn['gender'].value_counts(normalize = True, dropna = False)

Male      0.5167
Female    0.4313
NaN       0.0520
Name: gender, dtype: float64

In [13]:
df_dropna['gender'].value_counts(normalize = True)

Male      0.545042
Female    0.454958
Name: gender, dtype: float64

In [14]:
df_dropna['credit_card'].value_counts()

1    6687
0    2793
Name: credit_card, dtype: int64

In [15]:
df_dropna['active_member'].value_counts()

1    4897
0    4583
Name: active_member, dtype: int64

In [16]:
df_dropna['churn'].value_counts()

0    7459
1    2021
Name: churn, dtype: int64

In [17]:
df_dropna['age'].value_counts()

37     451
38     445
35     443
36     423
40     413
      ...
85       1
254      1
88       1
82       1
273      1
Name: age, Length: 118, dtype: int64

In [18]:
df_dropna['age'].unique()

array([ 41,  42,  39,  43,  44,  50,  29,  27,  31,  24,  34,  25,  35,
        45,  58,  32,  38,  46,  36, 282,  33,  40,  51,  61,  49,  37,
        19,  66,  56,  26,  21, 265,  55,  75,  22,  30,  28,  65,  48,
        52,  57,  73, 278, 288,  47,  54,  72,  20,  67,  79,  62,  53,
       254, 270,  80,  59, 274,  68,  23,  60, 259, 298, 256, 267,  70,
        63, 253,  64, 287,  18,  82,  69, 272, 290,  74, 280, 250,  71,
       279, 268,  76, 257, 294,  77, 283, 262, 289, 263, 255, 251, 271,
       297, 258,  88, 296, 260, 264, 286, 292,  85, 291,  84, 281, 293,
       269, 277,  78,  81, 295, 252, 284, 276, 261,  92, 285, 275,  83,
       273], dtype=int64)

In [19]:
df_age = df_dropna[df_dropna['age'] <= 200]

In [20]:
df_age['age'].value_counts()

37    451
38    445
35    443
36    423
40    413
     ...
92      2
82      1
88      1
85      1
83      1
Name: age, Length: 70, dtype: int64

In [21]:
df_age['age'].unique()

array([41, 42, 39, 43, 44, 50, 29, 27, 31, 24, 34, 25, 35, 45, 58, 32, 38,
       46, 36, 33, 40, 51, 61, 49, 37, 19, 66, 56, 26, 21, 55, 75, 22, 30,
       28, 65, 48, 52, 57, 73, 47, 54, 72, 20, 67, 79, 62, 53, 80, 59, 68,
       23, 60, 70, 63, 64, 18, 82, 69, 74, 71, 76, 77, 88, 85, 84, 78, 81,
       92, 83], dtype=int64)

In [22]:
df_age.shape

(9304, 12)

In [23]:
df_dropna['age'].mean()

43.24810126582278

In [24]:
df_age['age'].mean()

38.88725279449699

In [25]:
df_age['country'].value_counts()

France     4687
Spain      2293
Germany    1297
German      761
Grmany      266
Name: country, dtype: int64

In [26]:
df_country = df_age.replace(['German', 'Grmany'], 'Germany')

In [27]:
df_country['country'].value_counts()

France     4687
Germany    2324
Spain      2293
Name: country, dtype: int64

In [28]:
df_country['tenure'].value_counts()

2     978
1     968
8     955
7     952
3     942
5     941
4     919
6     905
9     901
10    450
0     393
Name: tenure, dtype: int64

In [29]:
df_country['products_number'].value_counts()

1    4711
2    4288
3     248
4      57
Name: products_number, dtype: int64

In [30]:
df_country['credit_score'].unique()

array([608, 502, 699, 850, 645, 822, 376, 501, 684, 528, 497, 476, 549,
       635, 616, 653, 587, 726, 732, 636, 510, 669, 846, 577, 756, 571,
       574, 411, 533, 553, 520, 722, 475, 804, 582, 472, 465, 556, 834,
       660, 776, 829, 637, 550, 698, 585, 788, 655, 601, 619, 656, 725,
       511, 742, 687, 555, 603, 751, 581, 735, 661, 675, 738, 813, 657,
       604, 664, 678, 757, 416, 665, 777, 543, 506, 493, 652, 750, 729,
       646, 647, 808, 524, 730, 515, 773, 814, 710, 413, 623, 670, 622,
       785, 605, 479, 685, 538, 562, 721, 628, 668, 828, 674, 625, 432,
       758, 795, 686, 789, 589, 461, 579, 663, 682, 691, 485, 650, 754,
       535, 716, 539, 614, 706, 586, 631, 717, 800, 683, 704, 615, 667,
       480, 578, 512, 484, 597, 778, 514, 525, 715, 580, 807, 759, 516,
       711, 618, 643, 671, 689, 620, 676, 572, 695, 592, 567, 547, 594,
       673, 610, 767, 763, 712, 703, 662, 659, 523, 772, 545, 634, 739,
       771, 681, 696, 766, 727, 693, 557, 531, 651, 791, 733, 811, 714,
       782, 799, 602, 744, 588, 747, 583, 627, 694, 731, 629, 438, 642,
       806, 474, 559, 429, 680, 749, 584, 626, 649, 805, 718, 840, 630,
       654, 762, 568, 613, 522, 737, 648, 443, 640, 540, 460, 593, 801,
       611, 802, 769, 745, 483, 690, 492, 705, 560, 709, 544, 752, 701,
       537, 487, 596, 702, 486, 724, 548, 464, 790, 534, 748, 494, 590,
       468, 509, 818, 816, 536, 753, 774, 621, 569, 658, 798, 641, 542,
       692, 591, 639, 765, 570, 638, 599, 632, 734, 793, 779, 707, 527,
       519, 564, 833, 504, 842, 508, 417, 607, 761, 848, 546, 439, 755,
       760, 526, 713, 700, 566, 495, 688, 612, 477, 427, 819, 720, 459,
       498, 503, 624, 529, 482, 796, 445, 746, 786, 554, 787, 499, 606,
       844, 450, 490, 815, 838, 803, 736, 633, 600, 679, 517, 792, 743,
       488, 598, 421, 708, 507, 505, 741, 456, 435, 561, 518, 565, 521,
       728, 672, 784, 552, 609, 764, 775, 697, 563, 723, 551, 444, 719,
       496, 541, 830, 812, 677, 420, 617, 809, 500, 826, 434, 513, 797,
       363, 399, 463, 780, 452, 575, 666, 837, 794, 824, 823, 781, 849,
       431, 489, 457, 768, 831, 359, 820, 573, 558, 817, 595, 449, 576,
       440, 415, 821, 530, 350, 446, 770, 425, 740, 481, 428, 783, 358,
       644, 845, 841, 451, 458, 469, 423, 404, 836, 473, 835, 478, 466,
       351, 827, 843, 365, 532, 414, 453, 471, 401, 491, 810, 832, 470,
       447, 422, 825, 430, 436, 426, 408, 847, 839, 418, 437, 410, 454,
       407, 455, 462, 386, 405, 383, 395, 467, 433, 442, 424, 448, 367,
       412, 382, 373, 419], dtype=int64)

In [31]:
df_country.head(15)

,customer_id,credit_score,tenure,products_number,credit_card,active_member,country,age,gender,balance,churn,estimated_salary
1,15647311,608,1,1,0,1,Spain,41,Female,83807.86,0,0.00
2,15619304,502,8,3,1,0,France,42,Female,159660.80,1,0.00
3,15701354,699,1,2,0,0,France,39,Female,0.00,0,0.00
4,15737888,850,2,1,1,1,Spain,43,Female,125510.82,0,0.00
5,15574012,645,8,2,1,0,Spain,44,Male,113755.78,1,0.00
6,15592531,822,7,2,1,1,France,50,Male,0.00,0,0.00
7,15656148,376,4,4,1,0,Germany,29,Female,115046.74,1,0.00
8,15792365,501,4,2,0,1,France,44,Male,142051.07,0,0.00
9,15592389,684,2,1,1,1,France,27,Male,134603.88,0,0.00
10,15767821,528,6,2,0,0,France,31,Male,102016.72,0,0.00
11,15737173,497,3,2,1,0,Spain,24,Male,0.00,0,0.00
12,15632264,476,10,2,1,0,France,34,Female,0.00,0,0.00
13,15691483,549,5,2,0,0,France,25,Female,0.00,0,190857.79
14,15600882,635,7,2,1,1,Spain,35,Female,0.00,0,0.00
15,15643966,616,3,2,0,1,Germany,45,Male,143129.41,0,0.00

In [32]:
df_country.shape

(9304, 12)

In [33]:
df_country.to_csv('Case_Bank_Customer_Final.csv', sep = ',', index = False, encoding = 'utf-8')